Replaced slurm diagram using mermaid
